[
  {
    "_id": "56b498d145a92004f8074c32",
    "Title": "KeyNote",
    "Description": "Ponencia de inauguración para la DotNet Spain Conference por Jose Bonnin, Technical Evangelist Manager de Microsoft.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "/Assets/DataImages/keynote.jpg",
    "Speaker": "Jose Bonnin",
    "Technology": "",
    "Time": "2016-02-24 10:00"
  },
  {
    "_id": "56b498d145a92004f8074c33",
    "Title": "Satya Nadella",
    "Description": "Satya Nadella será nuestro invitado de excepción en esta DotNet Spain Conference 2016",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "/Assets/DataImages/guest.jpg",
    "Speaker": "Satya Nadella",
    "Technology": "",
    "Time": "2016-02-24 12:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3ce",
    "Title": "Pero… C# no es un lenguaje de programación funcional, ¿verdad?",
    "Description": "C# es un lenguaje de programación multi-paradigma que soporta expresiones lambda desde el año 2007, y al que se le han ido añadiendo muchas características de programación funcional durante los últimos 10 años. Conoce C# 6.0, y cómo se ha convertido en uno de los mejores lenguajes de programación gracias a todas estas características. Aunque lleves años desarrollando con este lenguaje, esta sesión puede cambiarte la manera de utilizarlo de ahora en adelante.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Alejandro Campos",
    "Technology": "FW",
    "Time": "2016-02-24 11:00"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3cf",
    "Title": "Cuidando la visibilidad en nuestras arquitecturas",
    "Description": "La visibilidad es la característica de una arquitectura que permite ver dentro del software cuando algo va mal. Hay diferentes modos de dotar de visibilidad a nuestro software: trazas, contadores de rendimiento, modelos de salud y también diferentes herramientas que permite observar el comportamiento de nuestro software cuando este presenta problemas de rendimiento y estabilidad: profilers, depuradores, características avanzadas de tracing de los diferentes componentes de nuestra arquitectura y APMs. En esta sesión hablaremos de todas estas técnicas y herramientas y veremos cómo influyen en la disponibilidad de nuestras aplicaciones.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Rodrigo Corral",
    "Technology": "Tools/DevOps",
    "Time": "2016-02-24 11:00"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3d0",
    "Title": "Some dirty, quick and well-known tricks to hack your bad .NET WebApps",
    "Description": "Después de mucho sacrificio, al fin consigues que la aplicación funcione. Ha sido un trabajo duro e intenso porque no has conseguido llegar a tiempo con los plazos, pero al final funciona todo. La entregas, la pones en producción y... te hacen un bonito Defacement para promocionar Viagra al día siguiente. FAIL. No se lo pongas fácil. En esta sesión aprenderás algunos trucos y técnicas para que tu WebApp esté un poco más segura.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Chema Alonso",
    "Technology": "Web",
    "Time": "2016-02-24 11:00"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3d1",
    "Title": "Desarrollo de aplicaciones basadas en microservicios en .NET",
    "Description": "En esta charla veremos desde un punto de vista práctico como pasar de una aplicación tradicional de N-Capas a una arquitectura basada en microservicios usando tecnología .NET. Veremos los pros y cons de este tipo de arquitecturas, partiendo de una aplicación de comercio electrónico tradicional, hacía una arquitectura distribuida basada en microservicios con el objetivo de hacerla más escalable, mantenible e incluso con posibilidad de reutilizar estos microservicios en otras aplicaciones. Para este ejemplo usaremos tecnologías como ASP.NET 5 CoreCLR, Azure Service Fabric, Docker, Redis, SQL Azure…",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Roberto González",
    "Technology": "Cloud",
    "Time": "2016-02-24 11:00"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3d2",
    "Title": "50 piezas de Lego.  (No recomendada para mayores de 18 años)",
    "Description": "LEGO Mindstorms V3 no es sólo para niños.  Veremos cómo construirlo y controlarlo con .NET desde cualquier dispositivo.Aprenderemos cómo es la API de LEGO EV3, cómo controlar los motores, leer los sensores o darle órdenes al robot. Cuando tengamos el robot funcionando vamos a ver cómo podríamos controlarlo desde una web hospedada en Azure.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Isabel Cabezas y Beatriz García",
    "Technology": "IoT",
    "Time": "2016-02-24 11:00"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3d3",
    "Title": "Apphood: La historia de una app Windows 10",
    "Description": "Descubre de principio a fin el desarrollo una aplicación universal de Windows 10 (UWP) basada en experiencias reales. Veremos cómo empezar nuestra aplicación utilizando la librería Template10, que arquitectura usar para nuestro desarrollo, tips&tricks que nos hagan la vida más fácil y como conectarla con Azure.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Adrián Fernández",
    "Technology": "Apps",
    "Time": "2016-02-24 11:00"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3d4",
    "Title": "MvvmCross, desarrollo multiplataforma mediante patrones con Xamarin y C#",
    "Description": "Con Xamarin podemos crear mediante el uso de patrones y buenas practicas una solución multiplataforma, que comparta la mayor parte de nuestro código. Con un solo código, escrito en C# y desarrollado en Visual Studio, ya usemos Xamarin Classic o Xamarin Forms, usando MvvmCross, podremos usar bindings, comandos y demás artefactos del patrón Mvvm en soluciones Android e iOS. En esta charla veremos a grandes rasgos, como funciona esta librería, y como de forma sencilla podremos compartir más del 90% de código entre todas las plataformas que lo soportan. Xamarin.Android, Xamarin.iOS, Windows Phone 8.1, Windows Store 8.1 y aplicaciones universales de Windows 10.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Rafael Serna Medina",
    "Technology": "Cross-Plat",
    "Time": "2016-02-24 11:00"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3d5",
    "Title": "Power BI para desarrolladores ",
    "Description": "En esta sesión práctica veremos distintos ejemplos de cómo utilizar el API de Power BI para crear paneles que muestren datos en tiempo real a partir de Azure Stream Analytics, integrar un report en nuestra aplicación web o incluso crear nuestro propio elemento de visualización.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Mario Cortés",
    "Technology": "Data",
    "Time": "2016-02-24 11:00"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3d6",
    "Title": "Roslyn: Hello from the other compiler…",
    "Description": "Charla sobre las capacidades de extensión de Roslyn para c#.net. Queremos profundizar como añadir adaptaciones para la sintaxis y semántica en los lenguajes .net, nuevas expresiones, generación de código , y como utilizar las extensiones en el IDE de Visual Studio. En la sesión se mostrará como realizar adaptaciones sobre Roslyn para extender el comportamiento del análisis sintáctico y semántico del código, y generación de código y añadir estas extensiones sobre Visual Studio, disponiendo de está forma de nuevas capacidades sobre .net. Será una sesión más práctica que teórica, mostrando código y realizando la explicación sobre este.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Fernando Escolar y Juan Bacardit Barrer",
    "Technology": "FW",
    "Time": "2016-02-24 13:30"
  },  
  {
    "_id": "56cb0fa92b7b6606eca6a3d8",
    "Title": "Autenticación y autorización en ASP.NET Core 1.0",
    "Description": "Los mecanismos de autenticación y autorización han sido unos de los muchos aspectos en los que se han introducido novedades muy interesantes en MVC 6. Además, el hecho de unificar MVC y WebApi bajo un mismo framework nos plantea el cómo definir diferentes esquemas de autenticación para nuestras APIs y para nuestras vistas. Veremos cómo configurar más de un mecanismo de autenticación en nuestra aplicación, cuando nos interesa utilizar mecanismos basados en cookies o en tokens, cómo definir políticas de autorización reutilizables o cómo implementar una autorización basada no sólo en los claims del usuario, sino en las propiedades específicas del recurso al que se accede.Para ello utilizaremos varios ejemplos de aplicaciones implementadas con MVC 6 así comoel uso de Identity Server como proveedor OAuth2 y OpenId.Connect.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Hugo Biarge",
    "Technology": "Web",
    "Time": "2016-02-24 13:30"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3d9",
    "Title": "Docker para desarrolladores .NET",
    "Description": "En este sesión ,  vamos a ver una visión rápida de Docker y por qué es beneficioso. También vamos a profundizar en algunas de las preguntas más comunes sobre los contenedores.¿Que es Docker? ¿Porque utilizar Docker? ¿Que beneficios tiene Docker para los desarrolladores .NET?  Veremos como podemos instalar nuestros desarrollos en ASP.NET en un contenedor tanto Windows como Linux, asi como las herramientas integradas con Visual Studio",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Adrian Diaz Cervera",
    "Technology": "Cloud",
    "Time": "2016-02-24 13:30"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3da",
    "Title": "Tips and Tricks para el desarrollo de soluciones IoT en .Net",
    "Description": "Cuando construimos soluciones IoT vamos a tener que pelearnos con manejar un amplio abanico de tecnologías de hardware desde nuestras aplicaciones. El stack de Bluetooth, PWM, el protocolo OneWire, escrituras y lecturas en microsegundos, son sólo algunas de las técnicas y tecnologías que vamos a utilizar al construir nuestras soluciones. Además disponemos de muchos servicios que podemos utilizar para ampliar lo que está haciendo nuestro dispositivo, desde la ingestión de eventos hasta la detección de sentimientos en tiempo real. En esta sesión veremos cómo podemos hacer todo eso y mucho más con nuestra plataforma favorita y qué ventajas nos proporciona. También veremos cómo solucionar algunos de los problemas más frecuentes.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Juan Manuel Servera",
    "Technology": "IoT",
    "Time": "2016-02-24 13:30"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3db",
    "Title": "Deep dive into background tasks in the Universal Windows Platform",
    "Description": "Universal Windows apps have a different lifecycle than traditional desktop apps, since they can run on a wide range of devices with different capabilities. When an app is suspended, it isn’t able to perform any operation, so that resources can be focused on the active app. What if I need to do something even when it isn’t running? Let’s welcome background tasks! In this session we’re going to do a quick recap of the lifecycle of a Universal Windows app and then we’re going to see all the new background opportunities introduced in Windows 10: extended execution, app services, background interaction with Cortana and toast notifications and much more!",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Matteo Pagani",
    "Technology": "Apps",
    "Time": "2016-02-24 13:30"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3dc",
    "Title": "Rider - A Cross-Platform .NET IDE",
    "Description": "Rider is a new .NET IDE from JetBrains which provides a cross-platform experience for developing C# and VB.NET applications. Built on top of the IntelliJ platform, it provides many features you'd come to expect from an IDE. In this session we're going to take a look at some of the functionality of Rider and how it can help you create .NET 4.6 and .NET Core CLR applications. ",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Hadi Hariri",
    "Technology": "Cross-Plat",
    "Time": "2016-02-24 13:30"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3dd",
    "Title": "Monitorizando espacios mediante IoT y Azure ",
    "Description": "Hoy en día el IoT ya comienza a ser una de las palabras que más nos llaman pero que a su vez más desconocidas nos es; por este mismo motivo, vamos a explicar al detalle cómo podemos utilizar pequeños artefactos para recoger diferentes telemetrías . Veremos cómo podemos solucionar con Azure las necesidades de un escenario de ingestión masiva de telemetrías y su consumo con diferentes clientes. ",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Manu Delgado",
    "Technology": "Data",
    "Time": "2016-02-24 13:30"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3de",
    "Title": "Async best practices",
    "Description": "Tips sobre programación asíncrona que pueden salvarte la vida. O si no, ahorrarte un buen dolor de cabeza.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Lluís Franco",
    "Technology": "FW",
    "Time": "2016-02-24 15:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3df",
    "Title": "Aprovisionamiento y configuración de VMs con Resource Manager y PowerShell DSC",
    "Description": "Partiendo de una aplicación ASP.NET veremos algunas técnicas y tecnologías que podemos usar para simplificar el despliegue de aplicaciones ASP.NET en un entorno Cloud así cómo crear escenarios de entrega continua empleado VSTS y Azure. En la sesión nos centraremos en cómo aprovisionar entornos en Azure con Azure Resource Manager y cómo configurar y desplegar la aplicación ASP.NET con PowerShell DSC. Azure Resource Manager es un nuevo enfoque sobre el que se estructura toda la administración de Microsoft Azure. A través de un modelo declarativo podemos definir el estado de todos los recursos que forman parte de la infraestructura de nuestra aplicación, trabajar con plantillas y tratar los diferentes recursos como una única unidad administrativa por ejemplo, creándolos o eliminándolos de forma conjunta. PowerShell DSC (Desire State Configuration) es una extensión de PowerShell que permite definir de manera declarativa el estado de configuración deseado de una o varias máquinas, ayudando a simplificar enormement...",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Ibon Landa",
    "Technology": "Tools/DevOps",
    "Time": "2016-02-24 15:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3e0",
    "Title": "NET Core 1.0 y ASP.NET Core 1.0",
    "Description": "En esta charla veremos desde un punto de vista teórico/práctico las últimas novedades sobre todo el ecosistema OSS NET: Core 1.0 y ASP.NET Core 1.0. ¿Qué ha cambiado de la RC1? Vamos a resolver todas las dudas que te hayan surgido y te daremos las pautas necesarias para que puedas empezar a trabajar con estos nuevos frameworks.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Luis Ruiz Pavon",
    "Technology": "Web",
    "Time": "2016-02-24 15:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3e1",
    "Title": "De 0 a Azure en 75 minutos",
    "Description": "Durante esta sesión veremos todas las tecnologías y servicios necesarios al empezar un proyecto web en la actualidad.Seguiremos uno de los principios que más se siguen ahora, API First, una vez tengamos nuestra API veremos cómo exponerla, ganar dinero y no morir de éxito.Además veremos cómo publicar y monitorizar nuestra aplicación web y todos los servicios necesarios para que nuestra aplicación sea escalable,mantenible y siga todas las buenas practicas.esta charla vas a ver como Azure puede ayudarte a cumplir tus sueños: desde seguridad hasta notificaciones push, pasando por monitorización, y gestión de tus datos y APIs REST. ¿De verdad vas a perder esta oportunidad para dominar el mundo?",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Quique Martínez",
    "Technology": "Cloud",
    "Time": "2016-02-24 15:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3e2",
    "Title": "Modernizando las fábricas con Azure IoT hacia el concepto de Factorías 4.0",
    "Description": "En esta sesión veremos cómo aprovechar las capacidades de IoT de Azure para transformar los procesos de una fábrica y mejorar su capacidad de producción. Os mostraremos como conectar un brazo robótico industrial a Azure, ver sus datos de proceso, analizar la información con Power BI y predecir sus tiempos de mantenimiento con Machine Learning. ",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Alberto Diaz",
    "Technology": "IoT",
    "Time": "2016-02-24 15:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3e3",
    "Title": "Who is Who, Cortana?",
    "Description": "Jugaremos con Cortana, Win10 y Azure para descubrir quien es el friki más grande del evento. Si quieres conocer como utilizar todas estas tecnologías y ademas pasar un buen rato, no te lo puedes perder. ",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Marc Rubiño",
    "Technology": "Apps",
    "Time": "2016-02-24 15:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3e4",
    "Title": "Xamarin en aplicaciones corporativas con Azure. Juntos pero no revueltos!",
    "Description": "Mi propuesta se basa en una demostración de integración corporativa de aplicaciones multiplataforma Xamarin, empleando Azure para hacer Single Sign-On con una aplicación WebApi como sistema backend, utilizando una autorización por grupos de seguridad. Y todo ello incluyendo Universal Apps de Windows 10.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Juan Cuello ",
    "Technology": "Cross-Plat",
    "Time": "2016-02-24 15:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3e5",
    "Title": "Entity Framework Core 1.0",
    "Description": "En esta charla veremos los principales cambios introducidos en EF Core 1.0, desde los nuevos elementos relacionados con .NET Core 1.0, comandos, nuevos sistemas de migración  y los elementos más importantes que se han conseguido con la reescritura de Entity Framework. Si has trabajado ya con EF 6 en esta charla podrás ver cómo adaptarte a esta nueva versión y si no conocías Entity Framework podrás ver todo lo que te ofrece.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Unai Zorrilla",
    "Technology": "Data",
    "Time": "2016-02-24 15:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3e6",
    "Title": "Web funcional con F#",
    "Description": "Cuando hablamos de programación funcional muchas veces se tiende a pensar que solo es útil en aplicaciones que requieren cálculos matemáticos complejos. Veremos que esto no así ni muchísimo menos, y que las aplicaciones web, sea cual sea su naturaleza, encajan perfectamente con el paradigma funcional. En esta sesión aprenderemos a crear aplicaciones web utilizando F# y Suave.io, cómo utilizar los type providers para hacer peticiones a servicios REST y cómo desplegar aplicaciones web en Azure y Heroku utilizando FAKE.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Alex Casquete",
    "Technology": "FW",
    "Time": "2016-02-24 17:15"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3e7",
    "Title": "Gestiona tus propias dependencias con NuGet + Visual Studio Team Services vs MyGet",
    "Description": "Cuando estamos desarrollando aplicaciones, es inevitable generar dependencias con otros paquetes. Estas dependencias pueden dar lugar además a paquetes reutilizables para más de una aplicación que estés desarrollando. Para gestionar de un modo sencillo estas dependencias, en Visual Studio tenemos NuGet, que nos permite agregar referencias como paquetes, obtenidos de un repositorio central, que suele ser el repositorio de NuGet de Microsoft.Pero esto nos da facilidad para dependencias con componentes externos, pero, ¿qué ocurre con nuestros propios componentes?, también podemos generarlos como paquetes NuGet y hacer referencia a ellos de este modo, pero entonces surge la siguiente duda ¿Cómo gestiono un repositorio central de dependencias de mis propios proyectos?.Esto lo podemos hacer de un modo bien sencillo con el nuevo gestor de paquetes de Visual Studio Team Services, así como herramientas de terceros como MyGet. Además veremos como publicar nuestros propios paquetes desde las compilaciones automatizadas ...",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Luis Fraile",
    "Technology": "Tools/DevOps",
    "Time": "2016-02-24 17:15"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3e8",
    "Title": "ASP.NET5 Deep Dive",
    "Description": "Vale...probablemente estás hasta el moño de charlas de ASP.NET5. Bienvenido al club. Así que en esta charla nos saltaremos los preliminares, daremos por supuesto que ya conoces lo básico y nos adentraremos en las profundidades del framework. Veremos algunas particularidades del framework: localización, el modelo de bindings, tag helpers y la gestión de tokens y cadenas de conexón secretas, Si has jugado un poco con ASP.NET5 y conoces lo elemental pero quieres profundizar un poco más... esa es tu charla.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Eduard Tomas",
    "Technology": "Web",
    "Time": "2016-02-24 17:15"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3e9",
    "Title": "El arte del logging en el Cloud",
    "Description": "Cuando se desarrollan aplicaciones una de las partes más importantes que algunos desarrolladores olvidan son el registro y telemetría de una aplicación. Tener un registro de lo que está pasando en nuestra aplicación es fundamental, pero no solamente un simple registro, sino poder saber cómo de rápido (o lento) está funcionando el software, tener trazabilidad de la información de diagnóstico que ha generado una petición, que consultas de sql se han enviado a la base de datos y mucho más. Después de esto viene como explotar esa información y crear alertas. ",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Luis Guerrero",
    "Technology": "Cloud",
    "Time": "2016-02-24 17:15"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3ea",
    "Title": "Band 2 y la domótica casera",
    "Description": "Lo normal de la domótica es que sea casera, pero en este caso, lo que trataremos de aprender es cómo desde nuestra propia casa implementar prototipos de soluciones domóticas totalmente funcionales. Para ello, veremos un ejemplo práctico de cómo, con la ayuda de Arduino, controlar diferentes elementos de nuestro hogar usando la Microsoft Band 2.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Toni Recio",
    "Technology": "IoT",
    "Time": "2016-02-24 17:15"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3eb",
    "Title": "Adaptando controles a Continuum",
    "Description": "Partiendo de una serie de recomendaciones de buenas prácticas UX y las ventajas que tienen para el desarrollo, se mostrará la forma de hacer un mismo control autoadaptable a la interfaz que el usuario use en ese momento gracias a Continuum sin tener que implementar distintos controles para cada situación .",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Jon Burguera y Alberto Guerra",
    "Technology": "Apps",
    "Time": "2016-02-24 17:15"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3ec",
    "Title": "Hasta el beacon, todo es bluetooth",
    "Description": "En esta sesión veremos distintas maneras de trabajar con dispositivos Bluetooth LE como los beacons desde diferentes plataformas (las nuevas APIs de conectividad Bluetooth LE de Windows 10, componentes ya fabricados para Xamarin…), y las posibilidades que nos ofrecen estos dispositivos para extender la funcionalidad de nuestras aplicaciones junto con servicios cloud, utilizar datos de un contexto real, utilizar los datos de estos dispositivos como base para sacar conclusiones…",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Gorka Madariaga",
    "Technology": "Cross-Plat",
    "Time": "2016-02-24 17:15"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3ed",
    "Title": "Como hacer tuning a capas de acceso a datos en .NET",
    "Description": "En esta sesión hablaremos de tecnicas de profiling avanzado de aplicaciones .NET. Usaremos interceptores, compilaremos nuestra modificación de EntityFramework, usaremos ANTS profiler, analizaremos con PowerPivot, usaremos SQL Server Profiler, revisaremos cómo trabajamos nativamente con los datos ya capturados en la capa DAL de nuestra arquitectura,...Preparate para optimizar de verdad!",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Enrique Catalá",
    "Technology": "Data",
    "Time": "2016-02-24 17:15"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3ee",
    "Title": "Rx, la joya oculta de NET",
    "Description": "Las Reactive Extensions (Rx) de Microsoft llevan ya unos cuantos años disponibles para hacer la programación asíncrona mucho más sencilla. Sin embargo, casi nadie ha oído hablar de ellas y mucho menos las habrá usado en un proyecto. En esta sesión vamos a descubrir esta sencilla pero revolucionaria librería que permite pasar de un modelo pull de consumidor de datos a un modelo push de observador de los mismos. Descubre por qué Netflix basa su arquitectura en Rx y como Rx te puede ayudar en una arquitectura de aplicación de cloud. ",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Edin Kapic",
    "Technology": "FW",
    "Time": "2016-02-24 18:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3ef",
    "Title": "Planifica tu integración continua con Visual Studio Team Services.",
    "Description": "Visual Studio Team Services proporciona una solución para crear y desplegar tanto aplicaciones como servicios.En esta sesión veremos cómo integrar la herramienta de build de Visual Studio Team Services con varios controles de código fuente. Basados en Git, en TFS o cogiendo como origen GitHub.Buenas prácticas y consejos que debemos tener en cuenta a la hora de hacer el plan de nuestra estrategia de integración continua.También podemos comparar Visual Studio Team Services con otros servicios de automatización como Jenkins o Maven.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Luis Alfonso Rey del Saz",
    "Technology": "Tools/DevOps",
    "Time": "2016-02-24 18:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3f0",
    "Title": "Crea tus aplicaciones web con SPA, Angular2, Web Api y Visual Studio Code",
    "Description": "Una combinación espectacular para desarrollar tus aplicaciones web desde un entorno Open Source que junta toda la potencia de .NET Core, Angular 2 y Visual Studio Code cómo editor de código. Veremos cómo, a través de esta herramienta, podemos desarrollar una aplicación web moderna en pocos paso y bien estructurada.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Francesc Jaumot Peña y Jose Cousiño",
    "Technology": "Web",
    "Time": "2016-02-24 18:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3f1",
    "Title": "3 claves para escalar en Azure - lecciones aprendidas construyendo Plastic Cloud",
    "Description": "Durante la sesión contaremos la historia de cómo convertimos nuestro servidor de Plastic SCM en un servicio escalable sobre Azure. Compartiremos las lecciones aprendidas, la estructura del sistema y las claves para conseguir escalabilidad con un coste viable para que el servicio sea rentable.Plastic SCM es un sistema de control de versiones distribuido, eficaz para pequeños y grandes proyectos, que facilita la gestión de grandes ficheros, que necesitan una gran potencia de merge, GUIs muy visuales y usables, y mucha velocidad. Lo usan grandes clientes globales de todos los sectores como:  Samsung, Microsoft, HP, Telltale Games, Mapfre, Banco Santander, Delhi, NASA, Rolls Royce. Está muy implantado en estudios de videojuegos, +300 por todo el mundo, y organizaciones sin ánimo de lucro e incluso aficionados a la programación. Plastic Cloud es un control de versiones cloud basado en el núcleo del servidor de Plastic SCM y construido sobre Azure. Su principal objetivo es gestionar proyectos y ficheros muy grandes...",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Pablo Santos Luaces",
    "Technology": "Cloud",
    "Time": "2016-02-24 18:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3f2",
    "Title": "Wearables con C# y .NET: Microsoft Band 2, Apple Watch y Google Wear",
    "Description": "Los wearables han llegado para quedarse. Control de nuestra salud, acceso rápido a funciones de nuestro smartphone, comunicación… ofrecen un rango de usos increíble del que cualquier app puede beneficiarse, ya sea como función principal o como un complemento. En esta sesión aprenderemos como podemos usar C#, Visual Studio y Xamarin para programar para las plataformas wearables de Microsoft, Apple y Google.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Josue Yeray Julian Ferreiro",
    "Technology": "IoT",
    "Time": "2016-02-24 18:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3f3",
    "Title": "Microsoft Windows App Studio: Apps para Windows 10",
    "Description": "¿Cómo hace Windows App Studio para generar Aplicaciones Universales? Date un paseo por las principales características y controles que hemos añadido a Windows App Studio para generar Aplicaciones Universales para Windows 10. Revisa con nosotros el código generado por Windows App Studio y aprende sobre los patrones que hemos aplicado. Revisamos novedades en las librerías de código abierto que ponemos a disposición de la comunidad y que permiten reutilizar los controles de Windows App Studio directamente en vuestros proyectos de Aplicaciones Universales. Haremos una demo en la que repasaremos las últimas novedades creando una aplicación, a la que posteriormente, añadiremos funcionalidades con Visual Studio.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Martin Vega",
    "Technology": "Apps",
    "Time": "2016-02-24 18:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3f4",
    "Title": "Aumentando la productividad en el desarrollo Xamarin",
    "Description": "¿Alguna vez has añadido un elemento visual que no aparece en la vista y no sabes por que?, ¿cuánto tiempo pierdes compilando y desplegando una App Xamarin.Forms para ver cambios?. En esta sesión vamos a utilizar herramientas relacionadas con el desarrollo Xamarin para poder ver todos los cambios de UI al vuelo, poder realizar un desarrollo continuo sin necesidad de compilar, inspeccionar la aplicación y mucho más.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Javier Suárez Ruiz",
    "Technology": "Cross-Plat",
    "Time": "2016-02-24 18:45"
  },
  {
    "_id": "56cb0fa92b7b6606eca6a3f5",
    "Title": "Mejores Prácticas de conectividad, Seguridad y uso de CLR en SQL Server: Lecciones Aprendidas desde las trinchera",
    "Description": "Dos ingenieros de soporte de SQL Server explican cuáles son las mejores prácticas de conectividad y seguridad tanto para SQL Server on premises como para Azure Database. En una segunda parte se mostrara la potencia del CLR integrado en SQL Server, que podemos hacer con él, sus limitaciones y cómo podemos depurar nuestro código .NET corriendo dentro del motor de SQL Server.",
    "Url": "https://www.desarrollaconmicrosoft.com/Dotnetspain2016/Agenda",
    "Image": "",
    "Speaker": "Pablo Gavela Lopez / José Manuel Jurado Diaz",
    "Technology": "Data",
    "Time": "2016-02-24 18:45"
  }
]